load-testing/scenarios/heavy-load.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 120
      arrivalRate: 20
      name: "Warm up"
    - duration: 600
      arrivalRate: 1000
      name: "Heavy load - 1000 users"
  scenarios:
    - name: "Health Check"
      flow:
        - get:
            url: "/health"
    - name: "User Login"
      flow:
        - post:
            url: "/api/auth/login"
            json:
              email: "test@example.com"
              password: "password123"
    - name: "Get Appointments"
      flow:
        - get:
            url: "/api/appointments"
            headers:
              Authorization: "Bearer {{ token }}"
    - name: "Create Appointment"
      flow:
        - post:
            url: "/api/appointments"
            headers:
              Authorization: "Bearer {{ token }}"
            json:
              doctorId: "64c9a4f1a3d8b85a747e2d14"
              date: "2023-12-15T10:00:00Z"
              reason: "Checkup"
    - name: "Cancel Appointment"
      flow:
        - delete:
            url: "/api/appointments/{{ appointmentId }}"
            headers:
              Authorization: "Bearer {{ token }}"