load-testing/scenarios/light-load.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 100
      name: "Light load - 100 users"
  scenarios:
    - name: "Health Check"
      flow:
        - get:
            url: "/health"
    - name: "User Login"
      flow:
        - post:
            url: "/api/auth/login"
            json:
              email: "test@example.com"
              password: "password123"
    - name: "Get Appointments"
      flow:
        - get:
            url: "/api/appointments"
            headers:
              Authorization: "Bearer {{ token }}"