load-testing/scenarios/medium-load.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 500
      name: "Medium load - 500 users"
  scenarios:
    - name: "Health Check"
      flow:
        - get:
            url: "/health"
    - name: "User Login"
      flow:
        - post:
            url: "/api/auth/login"
            json:
              email: "test@example.com"
              password: "password123"
    - name: "Get Appointments"
      flow:
        - get:
            url: "/api/appointments"
            headers:
              Authorization: "Bearer {{ token }}"
    - name: "Create Appointment"
      flow:
        - post:
            url: "/api/appointments"
            headers:
              Authorization: "Bearer {{ token }}"
            json:
              doctorId: "64c9a4f1a3d8b85a747e2d14"
              date: "2023-12-15T10:00:00Z"
              reason: "Checkup"